public class Main {
/*
* Создать программу для обслуживания клиники домашних питомцев.
* Должна быть возможно добавлять клиентов.
* Указывать какой питомец есть у клиента.
* Возможность искать по кличке питомца, по имени клиента.
* Редактировать имя клиента, имя питомца.
* Удалять клиента, питомца.
* Возможность валидации.
*/
    public static void main(String[] args) {
        /*Client cl1=new Client("Ihor",new Dog("ridik"));
        System.out.println(cl1);
        cl1.getPet().makeSound();*/
        
    }
}
